import java.util.Scanner;

public class Main {
    public static void main(String[] args) {

        String [][] ArrAnimals = {
                {"Єнот усурійський", "Nyctereutes procyonoides", "Gray", "1834", "Адвентивний вид.Зустрічається на всій території України, за виключенням Криму.У південних степових регіонах притримується лісів, берегів річок та озер, сільськогосподарських угідь та приміських районів."},
                {"Лисиця звичайна", "Vulpes vulpes", "Linnaeus", "1758", "В Україні лисиця руда зустрічається по всій території."},
                {"Кіт лісовий", "Felis silvestris", "Schreber", "1777", "Вразливий вид, занесений до Червоної книги України.Сучасний ареал кота лісового в Україні охоплює Карпатський регіон, західне Полісся(Волинська та Рівненська області), Поділля, а також дельти Дунаю та Дністра."},
                {"Рись євразійська", "Lynx lynx", "Linnaeus", "1758", "Рідкісний вид, занесений до Червоної книги України.В Україні номінативна форма поширена на території Полісся —окремі р -ни Волинської, Житомирської, Київської, Рівненської, Чернігівської областей.Карпатська форма трапляється в Карпатах на території Львівської, Закарпатської, Івано -Франківської, Чернівецької областей.До XIX ст.вид був поширений в Карпатах, Поліссі, Лісостепу і Степу."}
        };

        for(int i=1; i<=ArrAnimals.length; i++)
            System.out.println(i+" "+ArrAnimals[i-1][0]);

        System.out.println("Введіть номер тварини, яку ви хочете переглянути детальніше, або змінити");
        Scanner sc1 = new Scanner(System.in);
        Integer num = sc1.nextInt();

        //System.out.println(num);

        Animals animals1 = new Animals(ArrAnimals[num-1]);
        animals1.Print("all");


        System.out.println("Якщо хочете завершити, нажміть Enter, або ввдедіть новий колір для тварини");
        Scanner sc2 = new Scanner(System.in);
        String newcolor = sc2.nextLine();
        if (newcolor.length()>0)
        {
            animals1.ChangeColor(newcolor);
            animals1.Print();
        }

    }
}